-----------------------------------------------------------------------------
-- kandaharu's init.lua
-----------------------------------------------------------------------------

vim.cmd("filetype on")
vim.cmd("syntax enable")

-----------------------------------------------------------------------------
-- フォルダ設定
-----------------------------------------------------------------------------
-- DOTVIM変数の設定
vim.g.dotvim = vim.fn.expand('~/.vim')
-- DEINDIR変数の設定
vim.g.deindir = vim.fn.expand('~/.config/nvim/dein')

-----------------------------------------------------------------------------
-- 設定ファイル読み込み
-----------------------------------------------------------------------------
require('settings')             -- 基本設定や表示設定など
require('keymaps')              -- キーマッピング
require('filetypes')            -- ファイルタイプ設定
require('plugins')              -- プラグイン設定
